GopalSaraf/Practicals/PSDL/include/proc/pic16f1947.inc
// Register: CCPR2H
#define CCPR2H CCPR2H
CCPR2H                                   equ 0299h
// bitfield definitions
CCPR2H_CCPR2H_POSN                       equ 0000h
CCPR2H_CCPR2H_POSITION                   equ 0000h
CCPR2H_CCPR2H_SIZE                       equ 0008h
CCPR2H_CCPR2H_LENGTH                     equ 0008h
CCPR2H_CCPR2H_MASK                       equ 00FFh

// Register: CCP2CON
#define CCP2CON CCP2CON
CCP2CON                                  equ 029Ah
// bitfield definitions
CCP2CON_CCP2M0_POSN                      equ 0000h
CCP2CON_CCP2M0_POSITION                  equ 0000h
CCP2CON_CCP2M0_SIZE                      equ 0001h
CCP2CON_CCP2M0_LENGTH                    equ 0001h
CCP2CON_CCP2M0_MASK                      equ 0001h
CCP2CON_CCP2M1_POSN                      equ 0001h
CCP2CON_CCP2M1_POSITION                  equ 0001h
CCP2CON_CCP2M1_SIZE                      equ 0001h
CCP2CON_CCP2M1_LENGTH                    equ 0001h
CCP2CON_CCP2M1_MASK                      equ 0002h
CCP2CON_CCP2M2_POSN                      equ 0002h
CCP2CON_CCP2M2_POSITION                  equ 0002h
CCP2CON_CCP2M2_SIZE                      equ 0001h
CCP2CON_CCP2M2_LENGTH                    equ 0001h
CCP2CON_CCP2M2_MASK                      equ 0004h
CCP2CON_CCP2M3_POSN                      equ 0003h
CCP2CON_CCP2M3_POSITION                  equ 0003h
CCP2CON_CCP2M3_SIZE                      equ 0001h
CCP2CON_CCP2M3_LENGTH                    equ 0001h
CCP2CON_CCP2M3_MASK                      equ 0008h
CCP2CON_DC2B0_POSN                       equ 0004h
CCP2CON_DC2B0_POSITION                   equ 0004h
CCP2CON_DC2B0_SIZE                       equ 0001h
CCP2CON_DC2B0_LENGTH                     equ 0001h
CCP2CON_DC2B0_MASK                       equ 0010h
CCP2CON_DC2B1_POSN                       equ 0005h
CCP2CON_DC2B1_POSITION                   equ 0005h
CCP2CON_DC2B1_SIZE                       equ 0001h
CCP2CON_DC2B1_LENGTH                     equ 0001h
CCP2CON_DC2B1_MASK                       equ 0020h
CCP2CON_P2M0_POSN                        equ 0006h
CCP2CON_P2M0_POSITION                    equ 0006h
CCP2CON_P2M0_SIZE                        equ 0001h
CCP2CON_P2M0_LENGTH                      equ 0001h
CCP2CON_P2M0_MASK                        equ 0040h
CCP2CON_P2M1_POSN                        equ 0007h
CCP2CON_P2M1_POSITION                    equ 0007h
CCP2CON_P2M1_SIZE                        equ 0001h
CCP2CON_P2M1_LENGTH                      equ 0001h
CCP2CON_P2M1_MASK                        equ 0080h
CCP2CON_CCP2M_POSN                       equ 0000h
CCP2CON_CCP2M_POSITION                   equ 0000h
CCP2CON_CCP2M_SIZE                       equ 0004h
CCP2CON_CCP2M_LENGTH                     equ 0004h
CCP2CON_CCP2M_MASK                       equ 000Fh
CCP2CON_DC2B_POSN                        equ 0004h
CCP2CON_DC2B_POSITION                    equ 0004h
CCP2CON_DC2B_SIZE                        equ 0002h
CCP2CON_DC2B_LENGTH                      equ 0002h
CCP2CON_DC2B_MASK                        equ 0030h
CCP2CON_P2M_POSN                         equ 0006h
CCP2CON_P2M_POSITION                     equ 0006h
CCP2CON_P2M_SIZE                         equ 0002h
CCP2CON_P2M_LENGTH                       equ 0002h
CCP2CON_P2M_MASK                         equ 00C0h

// Register: PWM2CON
#define PWM2CON PWM2CON
PWM2CON                                  equ 029Bh
// bitfield definitions
PWM2CON_P2DC0_POSN                       equ 0000h
PWM2CON_P2DC0_POSITION                   equ 0000h
PWM2CON_P2DC0_SIZE                       equ 0001h
PWM2CON_P2DC0_LENGTH                     equ 0001h
PWM2CON_P2DC0_MASK                       equ 0001h
PWM2CON_P2DC1_POSN                       equ 0001h
PWM2CON_P2DC1_POSITION                   equ 0001h
PWM2CON_P2DC1_SIZE                       equ 0001h
PWM2CON_P2DC1_LENGTH                     equ 0001h
PWM2CON_P2DC1_MASK                       equ 0002h
PWM2CON_P2DC2_POSN                       equ 0002h
PWM2CON_P2DC2_POSITION                   equ 0002h
PWM2CON_P2DC2_SIZE                       equ 0001h
PWM2CON_P2DC2_LENGTH                     equ 0001h
PWM2CON_P2DC2_MASK                       equ 0004h
PWM2CON_P2DC3_POSN                       equ 0003h
PWM2CON_P2DC3_POSITION                   equ 0003h
PWM2CON_P2DC3_SIZE                       equ 0001h
PWM2CON_P2DC3_LENGTH                     equ 0001h
PWM2CON_P2DC3_MASK                       equ 0008h
PWM2CON_P2DC4_POSN                       equ 0004h
PWM2CON_P2DC4_POSITION                   equ 0004h
PWM2CON_P2DC4_SIZE                       equ 0001h
PWM2CON_P2DC4_LENGTH                     equ 0001h
PWM2CON_P2DC4_MASK                       equ 0010h
PWM2CON_P2DC5_POSN                       equ 0005h
PWM2CON_P2DC5_POSITION                   equ 0005h
PWM2CON_P2DC5_SIZE                       equ 0001h
PWM2CON_P2DC5_LENGTH                     equ 0001h
PWM2CON_P2DC5_MASK                       equ 0020h
PWM2CON_P2DC6_POSN                       equ 0006h
PWM2CON_P2DC6_POSITION                   equ 0006h
PWM2CON_P2DC6_SIZE                       equ 0001h
PWM2CON_P2DC6_LENGTH                     equ 0001h
PWM2CON_P2DC6_MASK                       equ 0040h
PWM2CON_P2RSEN_POSN                      equ 0007h
PWM2CON_P2RSEN_POSITION                  equ 0007h
PWM2CON_P2RSEN_SIZE                      equ 0001h
PWM2CON_P2RSEN_LENGTH                    equ 0001h
PWM2CON_P2RSEN_MASK                      equ 0080h

// Register: CCP2AS
#define CCP2AS CCP2AS
CCP2AS                                   equ 029Ch
// bitfield definitions
CCP2AS_PSS2BD0_POSN                      equ 0000h
CCP2AS_PSS2BD0_POSITION                  equ 0000h
CCP2AS_PSS2BD0_SIZE                      equ 0001h
CCP2AS_PSS2BD0_LENGTH                    equ 0001h
CCP2AS_PSS2BD0_MASK                      equ 0001h
CCP2AS_PSS2BD1_POSN                      equ 0001h
CCP2AS_PSS2BD1_POSITION                  equ 0001h
CCP2AS_PSS2BD1_SIZE                      equ 0001h
CCP2AS_PSS2BD1_LENGTH                    equ 0001h
CCP2AS_PSS2BD1_MASK                      equ 0002h
CCP2AS_PSS2AC0_POSN                      equ 0002h
CCP2AS_PSS2AC0_POSITION                  equ 0002h
CCP2AS_PSS2AC0_SIZE                      equ 0001h
CCP2AS_PSS2AC0_LENGTH                    equ 0001h
CCP2AS_PSS2AC0_MASK                      equ 0004h
CCP2AS_PSS2AC1_POSN                      equ 0003h
CCP2AS_PSS2AC1_POSITION                  equ 0003h
CCP2AS_PSS2AC1_SIZE                      equ 0001h
CCP2AS_PSS2AC1_LENGTH                    equ 0001h
CCP2AS_PSS2AC1_MASK                      equ 0008h
CCP2AS_CCP2AS0_POSN                      equ 0004h
CCP2AS_CCP2AS0_POSITION                  equ 0004h
CCP2AS_CCP2AS0_SIZE                      equ 0001h
CCP2AS_CCP2AS0_LENGTH                    equ 0001h
CCP2AS_CCP2AS0_MASK                      equ 0010h
CCP2AS_CCP2AS1_POSN                      equ 0005h
CCP2AS_CCP2AS1_POSITION                  equ 0005h
CCP2AS_CCP2AS1_SIZE                      equ 0001h
CCP2AS_CCP2AS1_LENGTH                    equ 0001h
CCP2AS_CCP2AS1_MASK                      equ 0020h
CCP2AS_CCP2AS2_POSN                      equ 0006h
CCP2AS_CCP2AS2_POSITION                  equ 0006h
CCP2AS_CCP2AS2_SIZE                      equ 0001h
CCP2AS_CCP2AS2_LENGTH                    equ 0001h
CCP2AS_CCP2AS2_MASK                      equ 0040h
CCP2AS_CCP2ASE_POSN                      equ 0007h
CCP2AS_CCP2ASE_POSITION                  equ 0007h
CCP2AS_CCP2ASE_SIZE                      equ 0001h
CCP2AS_CCP2ASE_LENGTH                    equ 0001h
CCP2AS_CCP2ASE_MASK                      equ 0080h

