GopalSaraf/Practicals/PSDL/include/proc/pic16f1947.inc
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
LCDDATA20                                equ 07B4h
// bitfield definitions
LCDDATA20_SEG40COM2_POSN                 equ 0000h
LCDDATA20_SEG40COM2_POSITION             equ 0000h
LCDDATA20_SEG40COM2_SIZE                 equ 0001h
LCDDATA20_SEG40COM2_LENGTH               equ 0001h
LCDDATA20_SEG40COM2_MASK                 equ 0001h
LCDDATA20_SEG41COM2_POSN                 equ 0001h
LCDDATA20_SEG41COM2_POSITION             equ 0001h
LCDDATA20_SEG41COM2_SIZE                 equ 0001h
LCDDATA20_SEG41COM2_LENGTH               equ 0001h
LCDDATA20_SEG41COM2_MASK                 equ 0002h
LCDDATA20_SEG42COM2_POSN                 equ 0002h
LCDDATA20_SEG42COM2_POSITION             equ 0002h
LCDDATA20_SEG42COM2_SIZE                 equ 0001h
LCDDATA20_SEG42COM2_LENGTH               equ 0001h
LCDDATA20_SEG42COM2_MASK                 equ 0004h
LCDDATA20_SEG43COM2_POSN                 equ 0003h
LCDDATA20_SEG43COM2_POSITION             equ 0003h
LCDDATA20_SEG43COM2_SIZE                 equ 0001h
LCDDATA20_SEG43COM2_LENGTH               equ 0001h
LCDDATA20_SEG43COM2_MASK                 equ 0008h
LCDDATA20_SEG44COM2_POSN                 equ 0004h
LCDDATA20_SEG44COM2_POSITION             equ 0004h
LCDDATA20_SEG44COM2_SIZE                 equ 0001h
LCDDATA20_SEG44COM2_LENGTH               equ 0001h
LCDDATA20_SEG44COM2_MASK                 equ 0010h
LCDDATA20_SEG45COM2_POSN                 equ 0005h
LCDDATA20_SEG45COM2_POSITION             equ 0005h
LCDDATA20_SEG45COM2_SIZE                 equ 0001h
LCDDATA20_SEG45COM2_LENGTH               equ 0001h
LCDDATA20_SEG45COM2_MASK                 equ 0020h

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
LCDDATA21                                equ 07B5h
// bitfield definitions
LCDDATA21_SEG24COM3_POSN                 equ 0000h
LCDDATA21_SEG24COM3_POSITION             equ 0000h
LCDDATA21_SEG24COM3_SIZE                 equ 0001h
LCDDATA21_SEG24COM3_LENGTH               equ 0001h
LCDDATA21_SEG24COM3_MASK                 equ 0001h
LCDDATA21_SEG25COM3_POSN                 equ 0001h
LCDDATA21_SEG25COM3_POSITION             equ 0001h
LCDDATA21_SEG25COM3_SIZE                 equ 0001h
LCDDATA21_SEG25COM3_LENGTH               equ 0001h
LCDDATA21_SEG25COM3_MASK                 equ 0002h
LCDDATA21_SEG26COM3_POSN                 equ 0002h
LCDDATA21_SEG26COM3_POSITION             equ 0002h
LCDDATA21_SEG26COM3_SIZE                 equ 0001h
LCDDATA21_SEG26COM3_LENGTH               equ 0001h
LCDDATA21_SEG26COM3_MASK                 equ 0004h
LCDDATA21_SEG27COM3_POSN                 equ 0003h
LCDDATA21_SEG27COM3_POSITION             equ 0003h
LCDDATA21_SEG27COM3_SIZE                 equ 0001h
LCDDATA21_SEG27COM3_LENGTH               equ 0001h
LCDDATA21_SEG27COM3_MASK                 equ 0008h
LCDDATA21_SEG28COM3_POSN                 equ 0004h
LCDDATA21_SEG28COM3_POSITION             equ 0004h
LCDDATA21_SEG28COM3_SIZE                 equ 0001h
LCDDATA21_SEG28COM3_LENGTH               equ 0001h
LCDDATA21_SEG28COM3_MASK                 equ 0010h
LCDDATA21_SEG29COM3_POSN                 equ 0005h
LCDDATA21_SEG29COM3_POSITION             equ 0005h
LCDDATA21_SEG29COM3_SIZE                 equ 0001h
LCDDATA21_SEG29COM3_LENGTH               equ 0001h
LCDDATA21_SEG29COM3_MASK                 equ 0020h
LCDDATA21_SEG30COM3_POSN                 equ 0006h
LCDDATA21_SEG30COM3_POSITION             equ 0006h
LCDDATA21_SEG30COM3_SIZE                 equ 0001h
LCDDATA21_SEG30COM3_LENGTH               equ 0001h
LCDDATA21_SEG30COM3_MASK                 equ 0040h
LCDDATA21_SEG31COM3_POSN                 equ 0007h
LCDDATA21_SEG31COM3_POSITION             equ 0007h
LCDDATA21_SEG31COM3_SIZE                 equ 0001h
LCDDATA21_SEG31COM3_LENGTH               equ 0001h
LCDDATA21_SEG31COM3_MASK                 equ 0080h

// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
LCDDATA22                                equ 07B6h
// bitfield definitions
LCDDATA22_SEG32COM3_POSN                 equ 0000h
LCDDATA22_SEG32COM3_POSITION             equ 0000h
LCDDATA22_SEG32COM3_SIZE                 equ 0001h
LCDDATA22_SEG32COM3_LENGTH               equ 0001h
LCDDATA22_SEG32COM3_MASK                 equ 0001h
LCDDATA22_SEG33COM3_POSN                 equ 0001h
LCDDATA22_SEG33COM3_POSITION             equ 0001h
LCDDATA22_SEG33COM3_SIZE                 equ 0001h
LCDDATA22_SEG33COM3_LENGTH               equ 0001h
LCDDATA22_SEG33COM3_MASK                 equ 0002h
LCDDATA22_SEG34COM3_POSN                 equ 0002h
LCDDATA22_SEG34COM3_POSITION             equ 0002h
LCDDATA22_SEG34COM3_SIZE                 equ 0001h
LCDDATA22_SEG34COM3_LENGTH               equ 0001h
LCDDATA22_SEG34COM3_MASK                 equ 0004h
LCDDATA22_SEG35COM3_POSN                 equ 0003h
LCDDATA22_SEG35COM3_POSITION             equ 0003h
LCDDATA22_SEG35COM3_SIZE                 equ 0001h
LCDDATA22_SEG35COM3_LENGTH               equ 0001h
LCDDATA22_SEG35COM3_MASK                 equ 0008h
LCDDATA22_SEG36COM3_POSN                 equ 0004h
LCDDATA22_SEG36COM3_POSITION             equ 0004h
LCDDATA22_SEG36COM3_SIZE                 equ 0001h
LCDDATA22_SEG36COM3_LENGTH               equ 0001h
LCDDATA22_SEG36COM3_MASK                 equ 0010h
LCDDATA22_SEG37COM3_POSN                 equ 0005h
LCDDATA22_SEG37COM3_POSITION             equ 0005h
LCDDATA22_SEG37COM3_SIZE                 equ 0001h
LCDDATA22_SEG37COM3_LENGTH               equ 0001h
LCDDATA22_SEG37COM3_MASK                 equ 0020h
LCDDATA22_SEG38COM3_POSN                 equ 0006h
LCDDATA22_SEG38COM3_POSITION             equ 0006h
LCDDATA22_SEG38COM3_SIZE                 equ 0001h
LCDDATA22_SEG38COM3_LENGTH               equ 0001h
LCDDATA22_SEG38COM3_MASK                 equ 0040h
LCDDATA22_SEG39COM3_POSN                 equ 0007h
LCDDATA22_SEG39COM3_POSITION             equ 0007h
LCDDATA22_SEG39COM3_SIZE                 equ 0001h
LCDDATA22_SEG39COM3_LENGTH               equ 0001h
LCDDATA22_SEG39COM3_MASK                 equ 0080h

// Register: LCDDATA23
#define LCDDATA23 LCDDATA23
LCDDATA23                                equ 07B7h
// bitfield definitions
LCDDATA23_SEG40COM3_POSN                 equ 0000h
LCDDATA23_SEG40COM3_POSITION             equ 0000h
LCDDATA23_SEG40COM3_SIZE                 equ 0001h
LCDDATA23_SEG40COM3_LENGTH               equ 0001h
LCDDATA23_SEG40COM3_MASK                 equ 0001h
LCDDATA23_SEG41COM3_POSN                 equ 0001h
LCDDATA23_SEG41COM3_POSITION             equ 0001h
LCDDATA23_SEG41COM3_SIZE                 equ 0001h
LCDDATA23_SEG41COM3_LENGTH               equ 0001h
LCDDATA23_SEG41COM3_MASK                 equ 0002h
LCDDATA23_SEG42COM3_POSN                 equ 0002h
LCDDATA23_SEG42COM3_POSITION             equ 0002h
LCDDATA23_SEG42COM3_SIZE                 equ 0001h
LCDDATA23_SEG42COM3_LENGTH               equ 0001h
LCDDATA23_SEG42COM3_MASK                 equ 0004h
LCDDATA23_SEG43COM3_POSN                 equ 0003h
LCDDATA23_SEG43COM3_POSITION             equ 0003h
LCDDATA23_SEG43COM3_SIZE                 equ 0001h
LCDDATA23_SEG43COM3_LENGTH               equ 0001h
LCDDATA23_SEG43COM3_MASK                 equ 0008h
LCDDATA23_SEG44COM3_POSN                 equ 0004h
LCDDATA23_SEG44COM3_POSITION             equ 0004h
LCDDATA23_SEG44COM3_SIZE                 equ 0001h
LCDDATA23_SEG44COM3_LENGTH               equ 0001h
LCDDATA23_SEG44COM3_MASK                 equ 0010h
LCDDATA23_SEG45COM3_POSN                 equ 0005h
LCDDATA23_SEG45COM3_POSITION             equ 0005h
LCDDATA23_SEG45COM3_SIZE                 equ 0001h
LCDDATA23_SEG45COM3_LENGTH               equ 0001h
LCDDATA23_SEG45COM3_MASK                 equ 0020h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 0FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 0FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 0FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 0FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 0FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

